# TranslationX Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
AnalyticalLinkType..::..TranslationX Property
AnalyticalLinkType Class See Also
---
Fixity of translation along X.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AnalyticalFixityState TranslationX { get; set; }
```

Visual Basic
---
```text
Public Property TranslationX As AnalyticalFixityState
	Get
	Set
```

Visual C++
---
```text
public:
property AnalyticalFixityState TranslationX {
	AnalyticalFixityState get ();
	void set (AnalyticalFixityState value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The fixity state translationX is not valid for Analytical Link Type parameters. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace